tutorials/heatedCylinder/mixed/0/fluid/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../constant/include/CaseSetupValue";

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "Inlet|Top|Bottom|Outlet"
    {
        type        calculated;
        value       $internalField;
    }
   
    InterfaceFluid
    {
        type        nutkWallFunction;
        value       uniform 0;
    }

    FrontBack
    {
        type        empty;
    }
}

// ************************************************************************* //
