tutorials/heatedCylinder/mixed/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../constant/include/CaseSetupValue";

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $P;

boundaryField
{
    Inlet 
    {
        type        characteristicVelocityInletOutletPressure;
        U           ( $U 0.0 0.0 );
        p           $P;
        T           $Tf;
        value       $internalField;
    }

    "Outlet|Top|Bottom" 
    {
        type        characteristicPressureInletOutletPressure;
        U           ( $U 0.0 0.0 );
        p           $P;
        T           $Tf;
        value       $internalField;
    }

    InterfaceFluid
    {
        type        characteristicWallPressure;
        value       $internalField;
    }

    FrontBack
    {
        type            empty;
    }
}

// ************************************************************************* //
