tutorials/heatedCylinder/mixed/0/solid/D
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      D;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    InterfaceSolid
    {
        type    fixedValue;
        value uniform (0 0 0);
    }

    Free
    {
        type    fixedValue;
        value uniform (0 0 0);
    }

    FrontBack
    {
      type empty;
    }
}

// ************************************************************************* //
